from rutermextract import TermExtractor


def get_keywords(text):
    term_extractor = TermExtractor()
    normalized_data = []
    term_count = []
    for term in term_extractor(text):
        normalized_data.append(term.normalized)
        term_count.append(term.count)
    return normalized_data, term_count


if __name__ == '__main__':
    text = '''В неделе 168 часов. Если вы работаете по восемь часов в день, то ваша работа занимает 40 часов в 
    неделю. На сон уходит около 56 часов. Остальные 72 часа в неделю вы тратите «на все остальное». На что? Считали 
    ли вы это когда- нибудь? 72 часа — это практически две рабочих недели. Когда вы говорите, что у вас не хватило на 
    что-то времени, знайте, что у вас на самом деле его было достаточно. Многие ученые в сфере тайм-менеджмента 
    советуют это время выделять на приоритетные вещи: на прогулки с семьей, на важные проекты, на приятные и новые 
    для вас дела. Даже по часу в день. Это всего семь часов. Получается, что у вас на самом деле больше времени, 
    чем вы думаете. Поэтому вы можете уделять его тому, чем хотели бы заниматься, но никогда не находили для этого 
    свободной минуты. Попробуйте просто выделить для этого конкретное время. '''

    for term in get_keywords(text):
        print(term.normalized, term.count)
